import { BulletinOptions } from "vuepress-theme-plume";

export const myBulletin: BulletinOptions = {
    layout: 'center',
    border: true,
    enablePage: true,
    lifetime: 'session',
    contentType: 'markdown',
    title: '公告',
    content: `\
::: center
📣📣📣 号外号外 📣📣📣
:::

我们正在为 ==v1.8.0=={.tip} 做最后的准备，为后端响应信息提供 ==i18n=={.important} 支持

此功能向后兼容并已准备就绪：[PR #753](https://github.com/fastapi-practices/fastapi_best_architecture/pull/753) 

::: chat title="群聊"
{:2025-08-14 22:53:00}

{.}
i18n ==PR== 已经准备好了，如果没有问题，让我们合并它

{downdawn}
这个改版有点大，我们是否要考虑一下做分支，或者发起投票征求一下意见

{.}
这个 PR 目前是向后兼容的，理论上没有什么问题，我的想法是在本周的 v1.8.0 版本中提供，稍后我在 discord 上面发个投票看看

{.}
我们暂时先不要合并，等待社区反馈结果

{.}
==欢迎参与=={.important}：[投票链接](https://discord.com/channels/1185035164577972344/1322545989239832617/1405572816363065536)
:::

这是一个重大变更，非常期待大家的参与 🤗🤗🤗
`,
}
